Table of Contents
 Enum CheckResult
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
The number in enum value description means the priority for extreme check evaluation.
public enum CheckResult
Fields
CheckIsNotNecesssary = 6
check for some reason not necessary
CheckIsOff = 4
this kind of the calculation was switched off
Failed = 0
check value is bigger than limit check value
FailedWithError = 3
error appeared during calculation, calculation was terminated
NotDone = 5
this kind of the calculation was not done
Passed = 1
check value is lesser than limit check value
PassedWithWarnings = 2
check value is lesser than limit check value, but there is a warning in calculation
Fields
 Name |  Description
 CheckIsNotNecesssary = 6
check for some reason not necessary
 CheckIsOff = 4
this kind of the calculation was switched off
 Failed = 0
check value is bigger than limit check value
 FailedWithError = 3
error appeared during calculation, calculation was terminated
 NotDone = 5
this kind of the calculation was not done
 Passed = 1
check value is lesser than limit check value
 PassedWithWarnings = 2
check value is lesser than limit check value, but there is a warning in calculation
 Edit this page